{
  "Phase_1": {
    "Week_5": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, I just got back from Jakarta. It was a hectic trip, but I managed to stick to my low sugar diet!\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's great to hear, Rohan! How did you manage your meals while traveling?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"I found some good restaurants that offered healthier options. Also, I stayed hydrated, which helped.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Staying hydrated is key, especially with your travel schedule. Did you have any symptoms during the trip?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms, just a bit of fatigue from the long flights, but nothing I couldn't manage.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Glad to hear that! Just a reminder to keep up with your medication schedule while traveling.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I set reminders on my phone. Speaking of which, can you check if I missed any doses?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I'll check that for you. Also, how's your exercise routine going? Any light walks?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been doing light walks every morning. It’s been refreshing and helps me clear my mind.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Consistency is key. Have you noticed any improvements in your energy levels?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, definitely! I feel more energetic lately. Also, I wanted to ask about my wearable updates.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your wearable indicates you’ve been active most days. Keep it up! It's contributing positively to your health.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That’s reassuring to hear. I’ve also been trying to cut back on carbs. Any tips on that?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Focus on complex carbs and pair them with protein to stabilize your blood sugar. How’s your meal prep going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve started prepping meals for the week, which helps me avoid unhealthy choices.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great strategy! If you need recipe ideas, let me know. Have you experienced any symptoms lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms this week, feeling good overall!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful news! Let’s keep this momentum going. How about we schedule a follow-up to review your progress?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sure, that sounds good! I’d like to go over everything in detail.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect, I’ll arrange that. Looking forward to our chat!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! Appreciate all your help.\"}\n]",
    "Week_6": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, I wanted to check in after my trip to Tokyo last week. It went really well, and I was able to stick to my low sugar diet!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's fantastic, Rohan! Did you find it easy to manage your meals there?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I found some great places with healthy options. Plus, I kept my water bottle with me to stay hydrated.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Excellent! Hydration is so important, especially when traveling. Any symptoms during the trip?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms at all, just a little tired after the flights, but nothing I couldn't handle.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Just a reminder to keep on top of your medication. Have you been consistent?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I've been using reminders on my phone, and I haven't missed any doses!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Your wearable shows you’ve been active most days. Have you continued with your morning walks?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I’ve been enjoying my walks and feel that they help boost my energy.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's wonderful! Keep it up. Have you noticed any changes in your blood sugar levels?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been checking, and it seems to be more stable lately.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's encouraging! Also, are you still meal prepping? It can really help manage your diet.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I prep my meals for the week. It makes a big difference in avoiding unhealthy choices.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great strategy! If you need any new recipe ideas, just let me know.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I might take you up on that! Also, I have a question: should I be worried about my blood pressure readings?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It's good to monitor, especially since your last reading was a bit high. Let's keep an eye on it during our follow-up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good. Speaking of which, when can we schedule that follow-up to review everything?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"How about later this week? We can go over your recent travel experiences and health updates.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Perfect! I look forward to it. Thanks for all your support, Ruby!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You're doing an amazing job, Rohan! Let's keep this momentum going.\"}\n]",
    "Week_7": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, just checking in! I’ve been feeling great this week after my trip to Tokyo.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful to hear, Rohan! Have you noticed any changes in your energy levels?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I’m feeling more energetic, and my light walks have been refreshing.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Your wearable data also shows you’ve been quite active. Keep it up!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I’ve been consistent with my walks. Also, I prepped healthy meals for the week.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great strategy! What kind of meals have you been preparing?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Mostly grilled chicken with veggies and quinoa. It’s been tasty and filling!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sounds delicious! Have you had any symptoms or issues lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms at all! Just a slight headache yesterday, but it went away.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Glad to hear that! Just a reminder to stay hydrated, especially with your busy schedule.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been keeping my water bottle handy. Speaking of which, can you remind me about my medication?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Yes, how’s your adherence been? Any missed doses?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No missed doses! I’ve been diligent with my reminders.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s excellent! Your commitment is really showing. Have you checked your blood sugar levels?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I checked a couple of times this week, and they seem stable. Should I be worried about my blood pressure?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s monitor it closely. Your last reading was a bit high, but we’ll review it in our follow-up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Okay, sounds good. When can we schedule that follow-up?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"How about later this week? We can discuss your recent health updates and travel experiences.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Perfect! I look forward to it. Also, I wanted to ask about my blood test results.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Yes, I’ll prepare a detailed report for you. We can go over it during our follow-up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! Your support really helps me stay on track.\"}  \n]",
    "Week_8": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, I wanted to check in after my trip to Jakarta last week. Everything went well, and I managed to stick to my low sugar diet!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic to hear, Rohan! Did you try any new healthy places there?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I found some great local spots that had healthy options. It was a pleasant surprise!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Staying on track while traveling is a big win. Any symptoms during your trip?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms, just a bit of fatigue from the travel, but I managed well.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Glad to hear that! Remember to keep up with your hydration and medication schedule. Have you been consistent?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve set reminders and haven’t missed any doses. I feel good about that.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s excellent! Your wearable data shows you’ve been active, too. How's your exercise routine going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been doing my light walks every morning and it feels really refreshing!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Consistency is key. Have you noticed any changes in your energy levels?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I’ve been feeling more energetic lately.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Also, I wanted to ask about my blood test results. Should I be worried about my blood pressure readings?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your last reading was a bit high, so let’s keep monitoring it. We can review the detailed report together during our follow-up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I think a detailed review would help me understand better.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! Let’s schedule that follow-up soon. How about later this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Perfect! I look forward to it. Also, I’ve been prepping healthy meals for the week. Mostly grilled chicken and veggies.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great choice! Meal prepping can really help you stick to your diet. Any new recipes you want to try?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m open to suggestions! Any ideas for something different?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"How about trying a quinoa salad with roasted vegetables? It’s nutritious and delicious!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds tasty! I’ll definitely give it a try.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let me know how it turns out! And keep up with your hydration, especially with your busy travel schedule.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been keeping my water bottle handy. Thanks for the reminder!\"}\n]"
  },
  "Phase_2": {
    "Week_9": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you’re recovering well after your surgery. How are you feeling today?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I’m feeling a bit better, thanks. Just dealing with some discomfort from the appendectomy.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s understandable. Make sure you're following the doctor's post-op instructions. Have you been able to keep up with your diet?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been trying! Just sticking to soft foods for now.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good call. Remember, low sugar options are still important. How’s the wearable tracking going? Any updates?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I have it on, but I haven’t checked it since the surgery. I’ll check it later.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"No rush! Just make sure you’re comfortable. Once you're feeling better, we can revisit your exercise plan.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! Also, I wanted to ask, how do I manage my medication reminders while I'm recovering?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You can set reminders on your phone or I can help you set them up. Just let me know what you prefer.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I think I’ll take your help. I don’t want to miss any doses.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! I'll send you a quick guide to set them up. Have you had any symptoms since the surgery?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just some mild pain, but nothing too bad. I’m focused on recovery.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s good to hear. Please keep an eye on any unusual symptoms and let your doctor know.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! When can I start light walking again?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Usually, light walking can begin after a few days as long as you feel up to it. Just listen to your body.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Got it! I’ll start with a few steps around my apartment.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! And don’t forget to hydrate. Any other questions you have this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been tracking my blood sugar levels. What’s a good range to aim for post-surgery?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Post-surgery, aim for 80-130 mg/dL before meals. Let me know if you need help interpreting your results!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I’ll keep you posted on my progress.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Looking forward to it, Rohan! Take care and rest up.\"}\n]",
    "Week_10": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you’re feeling a bit better today. How’s the recovery going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm doing okay, just a bit frustrated with the mild infection at the incision site.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s understandable. Make sure to follow your doctor's advice on the antibiotics. Have you been able to keep up with your diet?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been sticking to soft, low-sugar foods. It’s a bit challenging but I’m managing!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great to hear! It’s important for your recovery. How's the medication reminder setup going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I set up reminders on my phone. I don’t want to miss any doses.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Consistency is key. Have you had any symptoms since starting the antibiotics?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just some mild discomfort, but nothing alarming. I’m more focused on healing.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s good. Just keep an eye on it. When do you have your follow-up appointment?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"It’s scheduled for next week. I hope the infection clears up by then.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fingers crossed! After your follow-up, we can discuss getting back to light walking. Have you checked your blood sugar lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I did, and it was around 120 mg/dL before lunch. Is that okay post-surgery?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s in a good range! Just keep aiming for 80-130 mg/dL before meals. Any plans for travel coming up?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I was supposed to travel to Jakarta next week, but I think I’ll need to postpone it.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds wise. Focus on your recovery first. We can discuss travel arrangements later.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely. I just want to make sure I'm fully healed before traveling.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! How are you feeling about getting back to your exercise routine once you're cleared?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m looking forward to it, but I’ll take it slow. I don’t want to push myself too hard.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a smart approach! We’ll create a manageable plan when you’re ready.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I appreciate all your support during this recovery.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! Just keep me updated on your healing process. You're doing great!\"}\n]",
    "Week_11": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How are you feeling today? I hope the fatigue is easing up a bit.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! It’s still a bit tough. I’m feeling fatigued and had some gastrointestinal issues. The antibiotics might be causing it.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That makes sense. Antibiotics can definitely affect your digestion. Have you been able to manage your diet well?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m sticking to low-sugar, soft foods, but it’s challenging. I’m also trying to include more fiber.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great idea! Increasing fiber can help with digestion. Are you still keeping up with your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I haven’t missed any doses! I feel more secure with the reminders.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Consistency is key. How about your blood sugar levels? Have you been checking them?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"My last reading was around 115 mg/dL before breakfast. I think that’s good, right?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a solid reading! Just keep aiming for that range. Any updates from your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I checked it today, and it looks like my activity levels are still low. I need to get moving.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It’s understandable with your recovery. Once you feel up to it, let’s plan for some light walking.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I’m eager to start moving again, but I don’t want to rush it.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a wise mindset! How’s the stress from work treating you? I know it can pile up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"It’s been pretty overwhelming. I’ve been trying to manage it with some breathing exercises.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a great strategy! Mindfulness can really help reduce stress. Have you thought about scheduling your travel plans yet?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I was thinking of postponing my trip to Jakarta. I just want to be fully recovered before traveling.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds like a smart decision. Focus on your health first. Let me know when you’re ready to reschedule.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! Also, do you have any tips for managing the gastrointestinal issues?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Try incorporating probiotics or yogurt into your diet if you can. They can help restore gut health.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds good! I’ll give it a try. Thanks for the suggestion.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! Just remember, I’m here to support you. Let’s check in again later this week!\"}\n]",
    "Week_12": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you’re feeling good today. How's the recovery going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm feeling much better. The incision site has healed well, and I’ve started light exercise.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's fantastic to hear! What kind of exercises are you doing?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just some gentle walking around my apartment for now. I want to take it slow.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a smart idea! Remember to listen to your body. Have you checked your blood sugar lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I checked it this morning, and it was around 110 mg/dL before breakfast.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! That’s a great level. Are you still keeping up with the medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! The reminders have been really helpful, and I haven't missed any doses.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Consistency is key. How about your diet? Any changes?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m focusing on a balanced diet with low sugar and adding more fiber. It's tough, but I'm managing!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great to hear! Fiber is excellent for digestion. Any updates from your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I checked it, and my activity levels are improving. I’m trying to get in more steps each day.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's encouraging! Just keep it up as you feel stronger. Any plans for travel soon?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m considering rescheduling my trip to Jakarta, but I want to be fully ready first.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds wise. Focus on your health first. Have you had any symptoms recently?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms lately, just a little fatigue, but it’s manageable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good to know! If fatigue persists, let’s explore some strategies to manage it. Any questions this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! What’s a good blood sugar range I should aim for now?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Aim for 80-130 mg/dL before meals. You’re doing great with your levels!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! Also, can you remind me about the upcoming test panel results?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! We’ll discuss the results in detail once they're available. You're making great progress!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I appreciate all your support. It’s really helping me stay on track!\"}\n]",
    "Week_13": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you're doing well today. How's everything going with your recovery and work?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm feeling good overall. Just trying to juggle work and recovery. How about you?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I'm great, thanks! Have you had a chance to check your blood sugar levels recently?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I checked it this morning before breakfast and it was 105 mg/dL.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's an excellent reading! You're staying right on track. How's the diet going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been focusing on low-sugar meals and incorporating more vegetables. It's getting easier!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Remember to keep that fiber intake up. Any updates from your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I checked it, and my activity levels have improved. I’m managing about 6,000 steps a day now!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's great progress! Just keep it gradual. Any thoughts on travel plans?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I'm considering rescheduling my trip to Jakarta for later this month, but I want to make sure I'm fully ready.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds like a smart plan. You could also explore options for healthier food choices while traveling.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! I’ve been looking into low-sugar snacks to take with me.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! That will help keep your blood sugar in check. How's the exercise routine? Any symptoms?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"The light walking is going well. I haven't had any major symptoms lately, just mild fatigue occasionally.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's good to hear! If the fatigue persists, let’s explore some strategies to boost your energy.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, that would be helpful. Also, can we discuss the test panel results soon?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! We can go over them once they come in. You're making great strides!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I appreciate your support. It really keeps me motivated.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I'm here for you! Just remember to stay consistent with your medication reminders.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I haven't missed a dose! The reminders have been really helpful.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's awesome! Keep it up. Any other questions or concerns this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just one—what should I do if I start experiencing any unusual symptoms?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"If anything feels off, reach out to your doctor right away. It's always better to be cautious.\"}\n]",
    "Week_14": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I'm glad to see you're doing well. How's everything going this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm feeling good overall. Managing work and my recovery has been smoother.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Have you checked your blood sugar lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, it was 102 mg/dL before breakfast today. I'm really happy with that!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! You're staying right on track. How's your diet?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I'm sticking to low-sugar meals and adding more vegetables. I feel like it’s really making a difference.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Keep up that good work. Any updates from your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been managing about 7,000 steps a day now. I'm feeling more energetic!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s impressive! Just remember to pace yourself. Any thoughts on your upcoming travel plans?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I'm thinking about rescheduling my trip to Jakarta, but I want to be fully ready first.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds wise. We can help you plan for healthier food options while traveling.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I want to avoid any high-sugar snacks.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good plan! How's your exercise routine going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've started light jogging as well. Just keeping it easy for now.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds like a great way to build stamina! Any symptoms you've experienced recently?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms lately—just occasional mild fatigue, but it's manageable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Glad to hear that! If the fatigue continues, we can explore some strategies to boost your energy.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be helpful, thanks! Also, can we discuss the test panel results soon?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! We can go over them in detail when they come in. You're doing great!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I appreciate all your support. It really keeps me motivated!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I'm here for you! Just remember to stay consistent with your medication reminders.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been diligent with my reminders, and I haven't missed any doses!\"}  \n]",
    "Week_15": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, I'm back from my trip to Tokyo! It was a whirlwind, but I managed to keep my diet in check. How are my blood sugar levels looking this week?\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Welcome back, Rohan! I'm glad to hear you kept your diet in check. Your blood sugar levels have stabilized, which is great news! How did you find the walking routine while traveling?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I got in some light walks, but it was tough with all the meetings. I’m thinking of incorporating more walking into my mornings. Any tips?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Morning walks are a fantastic idea! Maybe try 20-30 minutes before your day starts. It could help with your energy levels too.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I also wanted to ask about my medication reminders. I’ve been on top of them, but sometimes I forget when I’m busy.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"No worries, I can set up additional reminders for you. Would you prefer them in the morning or late evening?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Morning works best for me. Also, I was wondering about my wearable updates. Is there anything I should be focusing on?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your wearable shows good activity levels this week, but let’s aim for consistency. Aim for at least 10,000 steps daily. How does that sound?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds achievable! I’ll definitely try to keep up with that. What about my diet? Any suggestions for meals that can help with my blood sugar?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! Focus on high-fiber meals like quinoa salads with lots of veggies. It’ll help manage your blood sugar levels.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Great tip! I’ll give that a try. By the way, should I be concerned about my blood pressure readings? They were a bit high last time.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It's definitely something to keep an eye on. Let's ensure your diet and exercise support better blood pressure management. How have you been feeling overall?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Feeling good! No major symptoms lately, just the usual fatigue from travel. But I think the walking is helping.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's encouraging! Keep it up. If you notice any changes, let me know right away. We can schedule a check-up if needed.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I appreciate the support. I’ll make sure to stay consistent with everything.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You're doing great, Rohan! Remember, small changes make a big difference. Let me know if you need anything else.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! I’ll check in next week to update you on my progress.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Looking forward to it! Have a great week ahead!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! You too!\"}\n]",
    "Week_16": "[\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! Just got back from Jakarta. It was a busy trip, but I managed to stick to my morning walks.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Welcome back, Rohan! That's fantastic to hear! How’s your energy been with the walking?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely better! I feel more alert during the day. I’m also trying to incorporate more high-fiber meals.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great move! Have you tried adding beans or lentils to your meals? They’re excellent for managing blood sugar.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Not yet, but I will! By the way, I noticed a minor headache after my trip. Do you think it's related to my blood pressure?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It could be. Let's monitor your blood pressure closely. Have you been keeping up with your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been diligent about them. The morning reminders are really helping!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Keep it up. Just a note, your wearable data indicates your activity levels were lower during the trip. Let’s aim to boost that.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I’ll try to hit that 10,000 steps goal again this week.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Oh, and I wanted to ask about my blood sugar levels. How are they looking after the recent travel?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your levels have remained stable, which is great! Just keep being mindful of your meals and exercise.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That's a relief! I’m really trying to focus on healthier options.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s the spirit! If you need meal ideas, just let me know. Would you like me to set up any additional reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I think I’m good for now, but I’ll reach out if I need more help.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sounds perfect! Just remember, I’m here for you. How have you been feeling overall?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Feeling much better, actually! The headaches have subsided since I started walking more.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great news! Keep listening to your body. Let’s check in again next week to see how you’re progressing.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! I’ll keep tracking everything and report back.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Looking forward to it! Have a productive week ahead!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! You too!\"}\n]"
  },
  "Phase_3": {
    "Week_17": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I'm here for any support you need this week. How are you feeling after your allergic reaction?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby, I’m feeling much better now. Just trying to keep track of my diet closely. No shellfish for me from now on!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a good plan! Have you been able to adjust your meals? Let me know if you need any recipe ideas.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been focusing on more vegetables and lower sugar options. It’s a bit challenging with my travel schedule.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I understand! Speaking of travel, do you have any upcoming trips? We can help you plan meals and exercise.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ll be in Tokyo next week. Any tips on maintaining my routine while I'm there?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! I can help you find healthy dining options nearby. Also, remember to keep your medication reminders on.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, I will! I’ve been using my wearable device to track my steps. I’ve noticed my activity has increased a bit.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Consistent activity can really help manage your blood sugar levels. How has your walking routine been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been sticking to light walking daily. It feels good to have that routine, especially after the incident.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good job! Keeping active is key. Do you have any questions about your current plan or anything else?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been tracking my blood sugar but I’m unsure how to interpret the numbers. Can you help?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! How have your readings been lately? We can look at trends together.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"The average seems a bit high still. I’m worried about it.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s monitor that closely. We can schedule a check-in after your trip to discuss it further.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds good. I’ll make sure to stay on top of my diet and exercise.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Just remember to take your antihistamines before meals as a precaution.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! I appreciate the reminders and support from you all.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! We’re here for you. Let’s check in after your trip!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good, Ruby. Talk soon!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Take care and safe travels!\"}\n]",
    "Week_18": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! How did your trip to Tokyo go? Did you manage to stick to your routine?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! Tokyo was great, but I struggled a bit with my diet. There were so many tempting options!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I can imagine! Did you find any healthy places to eat?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I found a few places with good salads and grilled options. I tried to stick to low sugar, but it was tough.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a good effort! How about your activity level? Did you manage to get your steps in?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I did! My wearable showed I averaged about 8,000 steps a day. It felt good to be active.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! That's a great number. Just remember to keep up the walking now that you're back.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely. I'm trying to get back into my routine, but I've been feeling a bit drowsy from the antihistamines.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I understand. If it's too bothersome, you might want to check in with your doctor about adjusting the dosage.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That’s a good idea. I’ve also been more careful with my diet and checking labels. It’s becoming a habit!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great to hear! Just keep that focus, especially with your blood sugar in mind. How have your readings been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"They seem a bit high still. I’m worried about it.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s monitor that closely. We can schedule a follow-up soon to discuss your readings in detail.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, please! Also, I wanted to ask about the average blood sugar levels. What should I be aiming for?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Generally, a fasting blood sugar level between 80-130 mg/dL is ideal. We can review your specific targets.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby. I’ll keep an eye on that. I’m also a bit concerned about managing my fatigue.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fatigue can be tough, especially with your busy schedule. Make sure to prioritize rest and hydration.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! I’ve been trying to get more sleep, but it’s hard with work commitments.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Understandable. Maybe set specific times to wind down each night? It can help improve your sleep quality.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds like a good plan. I’ll give it a try.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! And don’t forget to take your antihistamines as directed. They can really help with those side effects.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! Thanks for all the support, Ruby.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! We’re here to help. Let’s check in again soon!\"}\n]",
    "Week_19": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! I hope you're doing okay. I heard you caught a cold. How are you feeling?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! I’m feeling a bit under the weather. Took a couple of sick days to recover.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a good idea. Make sure to rest and stay hydrated. Have you been able to eat well?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been keeping it simple—mostly soup and light meals. Still cautious about my diet.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good choice! Just be careful with sodium in packaged soups. Are you managing your blood sugar?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’m checking my levels, but they seem a bit high again. I’m worried.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s keep an eye on that. Once you’re feeling better, we can schedule a check-in.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds good. I also wanted to ask if my average blood sugar levels should be changing?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Typically, they should stabilize with a healthy diet and consistent exercise. How's your walking been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I haven’t been able to walk much with this cold. Just focusing on recovery right now.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Totally understandable. Once you're back to normal, try to ease back into your routine gradually.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely. I’ve been using my wearable, but I haven’t logged much activity this week.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s okay! Focus on getting better first. Just remember to keep taking your antihistamines.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! They’re still making me drowsy though, so it’s hard to concentrate.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"If it continues to be an issue, consider discussing it with your doctor. They might adjust the dosage.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Good idea. I’ll check in with them once I’m feeling better.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"In the meantime, keep up with your medication reminders. They’re super important!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely. I appreciate the reminders, Ruby. It helps me stay on track.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime! Once you’re feeling better, we can discuss meal options that are easy to prepare.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be great! Also, could you remind me what my target blood sugar levels should be?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sure! Aim for fasting levels between 80-130 mg/dL. We can review your progress soon.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby. I’ll keep that in mind. Hoping to feel better soon!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Take care of yourself, Rohan! Looking forward to hearing from you once you’re back on your feet.\"}\n]",
    "Week_20": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! I’m glad to hear you’re feeling better. How has your week been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! I’m feeling good and back to my routine at work. Just trying to stay on top of my health!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic! Have you been able to keep up with your exercise and diet?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been walking daily and focusing on my meals. I found some great low-sugar snacks!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! It’s great to hear you’re making those adjustments. Any upcoming travel plans?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ll be heading to Jakarta next week. I want to make sure I’m prepared.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"We can help you with meal options and exercise routines while you’re there. Let’s plan it out!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be really helpful! Also, I’ve been tracking my steps with my wearable, and it shows I'm averaging around 10,000 a day!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic progress! Keeping active is key for managing your blood sugar. How has your blood sugar been lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve noticed it’s stabilizing a bit, but I’m still aiming to get it lower. What should my target levels be again?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You should aim for fasting levels between 80-130 mg/dL. We can review your recent readings soon.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ll keep that in mind. I’m also planning to discuss my allergy management with my doctor during my follow-up.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds like a good plan! It’s important to have a long-term strategy. Let me know if you need any questions prepared.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! I also wanted to check on what to do about my antihistamine dosage. They still make me drowsy.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"If it’s bothering you, definitely mention it to your doctor. They might adjust it for you.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks for the advice! I’ve been focusing on cooking more at home, which has helped my diet.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Cooking at home gives you more control over ingredients. Need any recipe ideas?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’d love some quick and easy meal ideas that are low in sugar.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I can send you some recipes! Also, remember to keep your medication reminders on while traveling.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely, I’ve been really diligent with my medication. It feels good to be back on track.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s what we love to hear! Let’s schedule a follow-up after your trip to discuss your progress.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds perfect! I appreciate all the support, Ruby. Talk soon!\"}\n]",
    "Week_21": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! How was your trip to Jakarta? Did you find it easier to stick to your routine?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! Jakarta was great! I managed to find some healthy food options and kept up with my walking.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s awesome! What kind of meals did you find?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I found some great grilled chicken and vegetable dishes. I tried to avoid anything too sugary.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great choice! Keeping your meals balanced is key. How about your blood sugar readings?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"They’ve been a bit more stable, but I’m still aiming for lower levels. What should I be targeting?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Aim for fasting levels between 80-130 mg/dL. We can review your recent readings together.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I’ll make sure to keep tracking them. I’ve been averaging around 10,000 steps a day!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic! Consistent activity is really helping your health. Any symptoms to report?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms lately! I’m feeling pretty good overall. Just a bit of fatigue from work.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Make sure you’re taking time to rest and hydrate. Also, how are you managing your antihistamine?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been taking them regularly, but they still make me feel a bit drowsy at times.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It might be worth discussing dosage with your doctor. You want to feel your best!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Good idea! I have a follow-up appointment soon, so I’ll bring that up.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Let me know if you need help preparing questions for your doctor.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! Also, can you remind me what my target blood sugar levels should be again?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sure! Aim for fasting levels between 80-130 mg/dL. Keeping that in mind will help you.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I’m also focusing on cooking more at home to control my diet.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a great strategy! Need any quick and easy low-sugar recipes?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, please! I’d love some ideas for meals that are easy to prep.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I can send you a few! And remember to keep up with your medication reminders.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! I appreciate your support, Ruby. It really helps keep me on track.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! Let’s check in after your follow-up appointment to see how everything is going.\"}\n]",
    "Week_22": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! How have you been since your trip to Jakarta? Did you manage to keep up with your healthy habits?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! Jakarta was great! I found some good meals and kept walking. I’ve averaged around 10,000 steps a day since returning.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic! Consistent activity is so important. How about your blood sugar readings?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"They’ve been a bit more stable, but I’m still aiming for lower levels. What should I be targeting?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Aim for fasting levels between 80-130 mg/dL. We can review your recent trends soon.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I’ll keep tracking them. I’m also focusing on cooking more at home.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great strategy! Do you need any low-sugar recipe ideas?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, please! I’d love some quick meal ideas.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I’ll send you a few! Have you noticed any symptoms lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Actually, I’ve been feeling good overall! Just some mild fatigue from work.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Make sure you’re staying hydrated and getting enough rest. How’s the antihistamine working for you?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m still taking them, but they make me drowsy at times. I plan to discuss this with my doctor.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a good idea! Let me know if you need help preparing questions for your appointment.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! Also, I wanted to ask about my blood sugar levels. Should they be changing as I improve my diet?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Yes, they should stabilize with a healthier diet and routine. Consistency is key!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m trying! I’ve been checking labels and avoiding sugary snacks.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s perfect! Keep it up. Also, have you been able to stick to your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! I’ve been diligent about them. It helps keep me on track.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Let’s schedule a follow-up soon to discuss your progress.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I appreciate your support, Ruby. It really helps.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! Look out for those recipes. We’ll check in again soon!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I’m looking forward to trying out new meals.\"}\n]",
    "Week_23": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How have you been since your last trip? Did everything go smoothly?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! Jakarta was great! I found some healthy meals and kept up with my walking. Averaged around 10,000 steps a day!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic! Consistent activity is so important. How's your blood sugar been since returning?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"They’ve been more stable, but I’m still aiming for lower levels. What should I be targeting?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Aim for fasting levels between 80-130 mg/dL. We can review your recent readings together.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I've been checking my readings regularly, but I’m still worried about them.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s schedule a follow-up to go over your progress and any adjustments needed.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds good! I wanted to ask if my blood sugar levels should be changing as I improve my diet?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Yes, with a healthier diet and routine, your levels should stabilize. Consistency is key!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m trying! I’ve been cooking more at home and checking labels to avoid sugary snacks.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great strategy! Need any quick and easy low-sugar recipes?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, please! I’d love some ideas for meals that are easy to prep.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I’ll send you a few! Have you noticed any symptoms lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms lately! Just some mild fatigue from work.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Make sure you’re staying hydrated and getting enough rest. How’s the antihistamine working for you?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m still taking them regularly, but they make me feel a bit drowsy at times.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It might be worth discussing dosage with your doctor. You want to feel your best!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Good idea! I have a follow-up appointment soon, so I’ll bring that up.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let me know if you need help preparing questions for your appointment.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I will! Also, could you remind me what my target blood sugar levels should be again?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sure! Aim for fasting levels between 80-130 mg/dL. Keeping that in mind will help you.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I’m looking forward to trying out new meals and feeling better overall.\"}\n]",
    "Week_24": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hey Rohan! How's everything going this week? Did you manage to stick to your routine after Jakarta?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hi Ruby! I’m doing well, thanks! I found it easier to stick to my diet now that I'm back home.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Have you been able to keep up with your walking?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I’ve been averaging around 10,000 steps daily. It's become a habit!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Consistency is key for managing your blood sugar. How's your diet been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been cooking at home more and avoiding sugary snacks. It’s working out well!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! Keep checking labels and focusing on low-sugar options. Any symptoms lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms! Just a bit of fatigue from work, but it’s manageable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Glad to hear that! Make sure you’re getting enough rest and hydration. How are your blood sugar readings?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"They’ve been stabilizing, but I want to aim for lower levels. What should I be targeting?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Aim for fasting levels between 80-130 mg/dL. We can review your recent trends soon.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I also wanted to ask about my recent test panel results. Can we go over them?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! Your latest test results showed your blood pressure is still slightly high at 145/90 mmHg. We should monitor that.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Got it. I’ve been focusing on diet and exercise, but should I be concerned?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It’s definitely worth discussing with your doctor. They might suggest some lifestyle changes or medication.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ll bring that up during my follow-up appointment. What about my blood sugar levels?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your A1c levels are slightly elevated, but with your current efforts, they should improve. Let's keep monitoring.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I feel like I'm on the right track with my health.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You are! Just stay consistent with your medication reminders while traveling.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! I’ve been diligent about them. I appreciate your support, Ruby.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! Let’s check in after your follow-up appointment to discuss more.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds great! Looking forward to it.\"}\n]"
  },
  "Phase_4": {
    "Week_25": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you're doing well. I wanted to check in after your allergic reaction. How are you feeling today?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby. I'm feeling a bit better, just a little cautious about eating out now. Got prescribed antihistamines and an epinephrine auto-injector.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I'm glad to hear you're feeling better! Just a reminder to always carry your epinephrine auto-injector with you. Have you updated your diet plan to avoid allergens?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I'm trying to stick to safer options. But I have a work trip to Tokyo next week, and I'm a bit worried about dining there.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Totally understandable! I can help you find allergy-friendly restaurants in Tokyo. Would that be helpful?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"That would be great, thanks! Also, I've noticed some fluctuations in my blood sugar lately. Any tips on managing that?\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! Keeping a consistent meal schedule and monitoring your carb intake can help. Are you still tracking with your wearable?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, the wearable is on. I’ll check the app for insights. I have a question: I've been sticking to my light walking routine, but should I increase it?\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"If you're feeling up to it, gradually increasing your walking time could be beneficial. Aim for 30 minutes if you can!\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I'll give that a try. Also, I've been really good with my medication reminders lately.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That's fantastic to hear! Consistency is key. Do you want me to send you reminders while you're traveling?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, please! That would help a lot. I just want to stay on top of everything.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! I'll set that up for you. Have you had any symptoms since your last check-in?\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"No major symptoms, just a bit of nervousness about the allergy. But feeling good otherwise!\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great to hear! Remember to stay hydrated and keep stress levels low, especially with travel ahead.\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely. I’ll also check if there are any fitness centers near my hotel in Tokyo.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Let me know if you need help finding one. Keeping active while traveling is so important.\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I appreciate your support. Looking forward to the restaurant recommendations!\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You're welcome! I’ll send those over shortly. Stay safe and let me know if you need anything else.\"}, \n  {\"speaker\": \"Rohan\", \"message\": \"Will do! Talk soon.\"}, \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Take care, Rohan!\"}\n]",
    "Week_26": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I hope you're feeling okay today. How's the recovery going after the surgery?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! It’s been a bit tough. I’m feeling fatigued and there's mild pain at the incision site.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s understandable. Remember to take it easy and prioritize rest. Have you started physical therapy yet?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I had my first session yesterday. It was light, but I can feel it helping.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great to hear! Just be cautious with your movements. How's your diet been during recovery?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been sticking to low sugar options, but I'm worried about cravings.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Maybe try some low-sugar snacks? Fruits like berries or yogurt can help. Do you need any specific recipes?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That sounds good! Can you send me some options?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! I’ll send over a few low sugar recipes. Also, have you been tracking your blood sugar with your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ve been using it. Just checked, and it looks stable, which is a relief.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic news! Just keep monitoring it. Are you managing your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I am! Meera has been really helpful with that. No missed doses so far.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good to hear! Staying on top of your meds is crucial. Any travel plans coming up?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I have a trip to Tokyo in a couple of weeks. I’m a bit anxious about managing my health while away.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I totally understand! We can prepare a travel health plan for you. Just let me know what you need.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be great! What should I focus on while traveling?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Focus on your diet, stay hydrated, and keep up with your medication. We can also look into finding healthy food spots in Tokyo.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Perfect! Also, about my previous questions, should I be concerned about the fatigue?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fatigue can be normal after surgery, but if it persists, we might want to check in with your doctor. Let’s keep an eye on it.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby. I appreciate all the support. Feeling a bit more confident about everything.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! Just remember, we’re here for you. Talk soon with those recipes!\"}\n]",
    "Week_27": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How are you feeling today? I heard you developed a bit of a cough.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! Yeah, it's been a minor respiratory infection. Just some congestion and a mild cough.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I’m sorry to hear that. It’s important to rest. Have you been able to take some time off work?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I took a few days off to recuperate. Trying to take it easy.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good call! Staying hydrated and resting will help. Have you been able to stick to your low sugar diet?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m managing, but cravings pop up. Any suggestions for snacks?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"How about some nuts or seeds? They’re healthy and filling. I can send you some more snack ideas too.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be awesome! Also, I've been tracking my blood sugar—it’s slightly elevated but still manageable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s good to hear! Just keep monitoring it, especially while you're unwell. Have you been keeping up with your medication?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! Meera has been reminding me, no missed doses. I really appreciate her help.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great! Consistency is key. Any thoughts on how to manage your upcoming trip to Tokyo?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’m a bit anxious with this infection. Should I still go?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"If you’re feeling better by then, it should be fine. We can prepare a travel plan that includes resting and easy meals.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I’ll keep monitoring my symptoms. Do you think I should check in with my doctor?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Yes, especially if the cough persists. Better to be safe. Let me know if you need help arranging an appointment.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby. Also, can you remind me about the low sugar recipes you mentioned?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! I’ll send over some easy low sugar recipes for you to try while you recover.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I feel more in control now. Also, is there any update on the wearables for my blood sugar?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your wearable shows that your blood sugar has been stable, which is encouraging. Just keep monitoring it regularly.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Great to hear! I’ll make sure to keep an eye on it. Appreciate all your support.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! We’re here for you. Let’s touch base soon about those recipes and your health.\"}\n]",
    "Week_28": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! I’m glad to hear you’re feeling stronger! How’s the recovery going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! Feeling much better now. The cough has mostly gone, and I’m back to light exercises.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful news! It’s great that you’ve resumed some light activity. How’s your diet been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been sticking to low sugar meals and even trying out some new recipes. It’s actually been enjoyable!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic! If you need more recipe ideas, just let me know. Have you been consistent with your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! Meera has been reminding me, and I haven’t missed a dose. It really helps.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Good to hear! Keeping up with your medication is crucial. Are you ready for your trip to Tokyo?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I think so! I’m feeling more confident, but I still worry about managing my health while traveling.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Let’s prepare a travel health plan together. We can look for healthy food spots and plan your medication schedule.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That would be great! Also, I’ve been tracking my blood sugar. Any updates from the wearable?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your recent readings show your blood sugar is stable, which is encouraging! Just keep monitoring it.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That’s a relief! I’m trying to stay on top of it. Any tips for staying active during my trip?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Try to incorporate walking whenever you can. It’ll help with your energy levels and blood sugar management.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Sounds good! I’ll make sure to walk around. Also, about the congestion I had, it’s completely gone now.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I’m glad to hear that! Just keep listening to your body. If anything feels off, don’t hesitate to reach out.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks! I appreciate all the support. Do you think I should check in with my doctor before traveling?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"It might be a good idea, especially since you had the infection. Better to be cautious.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ll arrange that. Also, I’d like to discuss my last test panel results when you have a moment.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Absolutely! Your test showed high blood pressure, so let’s ensure we manage that, especially with your travel coming up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I remember. I’ll focus on managing stress and keeping my diet in check.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a good plan! Keep up the good work, and let’s touch base soon about your travel preparations.\"}\n]",
    "Week_29": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How's everything going as you prepare for your trip to Tokyo?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm feeling good, just a bit anxious about managing my blood sugar while traveling.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s understandable. Have you been able to stick to your low sugar diet this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I've been experimenting with some new recipes. I even made a low sugar stir-fry!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds delicious! If you want, I can send you more recipe ideas.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’d love that! Also, I’ve been keeping up with my medication reminders, thanks to Meera.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Consistency with your meds is key, especially with your upcoming trip.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I also wanted to check in about my wearables. Any updates on my blood sugar?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your recent readings show your blood sugar remains stable, which is fantastic!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That's a relief! I’m trying to stay active too. I’ve been taking longer walks.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Walking is a great way to manage your energy levels. Are you still feeling any symptoms from the infection?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms at all now! I feel stronger after the physical therapy.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful! Just remember to listen to your body while traveling. Have you thought about packing any snacks?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I have! I’m planning to take some nuts and low sugar protein bars.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great choice! Those will help keep your energy up. Any other concerns before you leave?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’d like to discuss my last test panel results. Can we go over them?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! The results showed your blood pressure is still high. We need to ensure you manage that while traveling.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’ll focus on stress management and sticking to my diet.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a solid plan! Remember to take breaks and hydrate during your trip.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I really appreciate all your help. I feel much more prepared.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! We’re here to support you. Let’s touch base once you’re back from Tokyo!\"}\n]",
    "Week_30": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How are you feeling after your trip to Tokyo?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I’m feeling good! The trip went well, and I managed to keep my blood sugar in check.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great to hear! Did you find any healthy food options while you were there?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I discovered some great low sugar options at local restaurants. I even had a delicious grilled fish with vegetables.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sounds amazing! It’s great that you could enjoy the local cuisine while sticking to your diet.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! I also made sure to stay active by walking around a lot.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Walking is a fantastic way to keep your energy up. How did your body feel during the trip?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I felt pretty good, no symptoms from my previous infection, which was a relief.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful news! Have you been keeping up with your medication and wearables?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! Meera helped me a lot with reminders. I tracked my blood sugar regularly and it stayed stable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Stability is key. Did you have any concerns while you were away?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just a bit worried about managing stress, but I kept my breathing exercises in mind.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a great approach! Stress management is crucial. Have you returned to your regular routine?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, I’m back to my light walking and have been trying some new low sugar recipes.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"I’d love to hear about those recipes! Any favorites?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I made a zucchini noodles dish with a low sugar tomato sauce that turned out great!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds delicious! I can send you more recipes if you’d like.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I would appreciate that! Also, I wanted to check in on my recent test panel results.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sure! Your recent test showed your blood pressure is still elevated, so let's focus on managing that.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been mindful of my stress levels and diet. What else should I do?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Incorporating more relaxation techniques and staying active can help. Let’s keep monitoring it closely.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! Your support really makes a difference.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Anytime, Rohan! We’re here for you. Let’s touch base again soon!\"}\n]",
    "Week_31": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How are you feeling after your trip to Tokyo?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm doing well! The trip was great, and I managed to keep my blood sugar stable.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s fantastic to hear! Did you find it easy to stick to your low sugar diet while you were there?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I found some amazing restaurants with healthy options. I had grilled fish and lots of veggies.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Sounds delicious! Have you been able to maintain that healthy eating since you returned?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely! I’ve been trying new recipes, like a low sugar stir-fry. It's been fun!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great! If you want more ideas, just let me know. How’s your exercise routine going?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've been sticking to my light walking routine. I feel more energized!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful! Staying active will help with your blood sugar too. Have you been tracking your levels with your wearable?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes, my readings have been stable, which is a relief after the last few weeks.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Fantastic! Consistency is key. Have you had any symptoms since returning?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms at all! I think the walking and healthy eating helped a lot.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s great news! Are you still keeping up with your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! Meera has been a lifesaver with that. No missed doses.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! It’s crucial to stay consistent with your meds. How's your blood pressure been?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I wanted to ask about that—my last test showed it was still elevated. What should I do?\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"We need to keep monitoring it closely. Stress management and diet will help. Have you been doing any relaxation techniques?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I've started doing some deep breathing exercises. They really help!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s perfect! Let’s make sure to incorporate those into your routine. Any other concerns?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Just the usual worries about stress, but I’ll keep working on my techniques.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"You’re doing great, Rohan! Keep up the good work, and let’s touch base soon to review your progress.\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! I appreciate your support. I feel like I'm on the right track.\"}\n]",
    "Week_32": "[\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Hi Rohan! How's everything going as you get ready for your trip to Jakarta?\"},\n  {\"speaker\": \"Rohan\", \"message\": \"Hey Ruby! I'm feeling good. Just a bit anxious about managing my blood sugar while traveling again.\"},\n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s completely understandable. Have you been sticking to your low sugar diet this week?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I've been trying out some new recipes, like a low sugar curry. It was delicious!\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That sounds amazing! If you want, I can send you more recipe ideas for your trip.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’d appreciate that! I also wanted to ask about my blood sugar readings from the wearable.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Your recent readings show that your blood sugar is stable, which is fantastic!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"That's a relief! I’ve been staying active with my walking routine. It really helps.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Perfect! Keeping active is key. Have you been experiencing any symptoms lately?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"No symptoms at all! I feel stronger after focusing on my diet and exercise.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s wonderful! Are you still keeping up with your medication reminders?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Definitely! Meera has been great with that. No missed doses so far.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Awesome! It’s important to stay consistent with your meds, especially with travel coming up.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Absolutely. I also wanted to discuss my recent test panel results when you have a moment.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Of course! Your test showed your blood pressure is still elevated, so let’s focus on managing that.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Got it. I’ll keep working on stress management and sticking to my diet.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s a solid plan! Incorporating more relaxation techniques can really help.\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"I’ve been doing my deep breathing exercises, and they really help reduce my stress.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"That’s perfect! Keep up with those techniques. Have you thought about packing any snacks for your trip?\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Yes! I’m planning to take some low sugar protein bars and nuts.\"},  \n  {\"speaker\": \"Ruby (Elyx Concierge)\", \"message\": \"Great choices! Those will help keep your energy up during travel. Let’s touch base again soon!\"},  \n  {\"speaker\": \"Rohan\", \"message\": \"Thanks, Ruby! Your support really makes a difference. I feel more prepared for my trip.\"}\n]"
  }
}